<a href="https://colab.research.google.com/github/juancamilo9/works_data_science/blob/master/Ejercicios_de_Pandas_en_el_conjunto_de_datos_de_Titanic_(base).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')
import pandas as pd

Mounted at /content/drive

In [4]:
filename = '/content/drive/MyDrive/titanic.csv'
df = pd.read_csv(filename)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# Muestren el centro del marco de datos.

In [18]:
# ¿Cuál es el porcentaje de las personas que sobrevivió? (pista: encuentren la media de la columna de supervivencia).
df['Survived'].mean()

0.3838383838383838

In [ ]:
# ¿Cuántos de cada sexo sobrevivieron?
df.head()
# realizo un filtor para saber cuantas mujeres y hombres habian en el barco
filter_male = df['Sex'] == 'male'
filter_female = df['Sex'] == 'female'

# realizo un filtro para seleccionar le cantidad de sobrevivientes
filter_survived = df['Survived'] == 1
# Agrupo ambos filtros que cumplan con la condición
filter_female_survived = df.loc[filter_survived & filter_female, :]
filter_male_survived = df.loc[filter_survived & filter_male, :]
# sumos sus valores
print("********** HOMBRES QUE SOBREVIVIERON ***********")
print(filter_male_survived['Survived'].value_counts())
print("********** MUJERES QUE SOBREVIVIERON ***********")
print(filter_female_survived['Survived'].value_counts())
print("***OTRA FORMA")
print(df.groupby('Survived')['Sex'].value_counts())

********** HOMBRES QUE SOBREVIVIERON ***********
1    109
Name: Survived, dtype: int64
********** MUJERES QUE SOBREVIVIERON ***********
1    233
Name: Survived, dtype: int64
***OTRA FORMA
Survived  Sex
0         male      468
          female     81
1         female    233
          male      109
Name: Sex, dtype: int64

In [35]:
#Si consideran solo el grupo de pasajeros que pagó menos de $10, ¿cuál sería el porcentaje de este grupo que sobrevivió?
filter_fare = df['Fare'] < 10.00
df[filter_fare]
df.groupby(filter_fare)['Survived'].mean()

Fare
False    0.495495
True     0.199405
Name: Survived, dtype: float64

In [68]:
# En total, ¿cuál es la edad promedio de los que no sobrevivieron?
# En total, ¿cuál es la edad promedio de los que sobrevivieron?
# 0 Edad promedio de quienes no sobrevivieron
# 1 Edad promedio de quienes sobrevivieron
df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [70]:

#¿Cuál es el promedio de edad de lo que sobrevivieron y no agrupados por sexo?
# Supongo que lo que quiere decir es agrupar el promedio por sexos
df.groupby(['Survived','Sex'])['Age'].mean()

Survived  Sex
0         female    25.046875
          male      31.618056
1         female    28.847716
          male      27.276022
Name: Age, dtype: float64